# Pandas:

In [2]:
# Pandas:

import pandas as pd

In [3]:
info  = {
    "Name" : ["Satinder Singh Sall", "Soni Vaibhav Kumar", "K Santosh Reddy"],
    "CGPA" : [6.9, 7.9, 7.5]
}

df =  pd.DataFrame(info)

print(df)

                  Name  CGPA
0  Satinder Singh Sall   6.9
1   Soni Vaibhav Kumar   7.9
2      K Santosh Reddy   7.5

In [4]:
df

                  Name  CGPA
0  Satinder Singh Sall   6.9
1   Soni Vaibhav Kumar   7.9
2      K Santosh Reddy   7.5

# Series in Pandas:

In [19]:
# Series in Pandas:

s = pd.Series([1, 2, 3, 4, 5])

print(s)
print(type(s))

# index
print(s[0])
print(s[3])
print(s.index)

print("\n")

# label:
s2 = pd.Series([22, 23, 24, 25, 26], index = ["Adam", "Eve", "Bob", "Charlie", "Nick"])
print(s2)
print(s2["Nick"])
print(s2["Charlie"])
print(s2.index)

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
4
RangeIndex(start=0, stop=5, step=1)


Adam       22
Eve        23
Bob        24
Charlie    25
Nick       26
dtype: int64
26
25
Index(['Adam', 'Eve', 'Bob', 'Charlie', 'Nick'], dtype='object')

# Series Properties:
- Homogeneous in Nature
- Vectorised Operations
- Handle Missing Values with NaN
- Mutable Values but Immutable Sizes

In [22]:
# Series Properties:

s = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])

print(s + s2)

0    11
1    22
2    33
3    44
4    55
dtype: int64

# Data Frame in Pandas:

In [27]:
# Data Frame in Pandas:

info = {
    "Name" : ["Satinder", "Vaibhav", "Santosh"],
    "Age" : [22, 19, 22],
    "CGPA" : [6.9, 7.9, 8]
}

data_frame = pd.DataFrame(info)

print(data_frame, type(data_frame))

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0 <class 'pandas.core.frame.DataFrame'>

In [28]:
data_frame

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [30]:
print(data_frame.index)
print(data_frame.columns)

RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [32]:
data = [
    {"Name": "Satinder", "Age": 22, "CGPA": 6.9},
    {"Name": "Vaibhav", "Age": 19, "CGPA": 7.9},
    {"Name": "Santosh", "Age": 22, "CGPA": 8.0}
]

df = pd.DataFrame(data)
print(df)

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [33]:
data = [
    ["Satinder", 22, 6.9],
    ["Vaibhav", 19, 7.9],
    ["Santosh", 22, 8.0]
]

df = pd.DataFrame(data, columns=["Name", "Age", "CGPA"])
print(df)

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [35]:
data = (
    ["Satinder", "Vaibhav", "Santosh"],
    [22, 19, 22],
    [6.9, 7.9, 8]
)

df = pd.DataFrame({
    "Name": data[0],
    "Age": data[1],
    "CGPA": data[2]
})

print(df)

       Name  Age  CGPA
0  Satinder   22   6.9
1   Vaibhav   19   7.9
2   Santosh   22   8.0

In [37]:
import numpy as np
import pandas as pd

arr = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(arr, columns=["A", "B", "C"])

print(df)

   A  B  C
0  1  2  3
1  4  5  6

# Pandas with CSV & JSON data:

In [40]:
# Pandas with CSV & JSON data:

df = pd.read_csv("employee_data.csv")

df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

# Data Frame Methods:

In [48]:
# Data Frame Methods:

df

# 1. head() → first 5 rows
df.head()

# 2. tail() → last 5 rows
df.tail()

# 3. sample() → random rows
df.sample(3)

# 4. info() → information about dataframe
df.info()

# 5. shape → total rows & columns
df.shape

# 6. describe() → statistics summary (numerical columns)
df.describe()

# 7. columns → list of column names
df.columns

# 8. nunique() → unique values per column
df.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

# Kaggle Data Set:

In [59]:
# Kaggle Data Set:

data_frame = pd.read_csv("global_air_quality.csv")

data_frame
data_frame.head()
data_frame.tail()
data_frame.describe()

,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
count,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000
mean,23.065980,37.655560,40.369131,70.152228,32.055176,6.035508,48.065100,0.800595,104.645556,21.510251,57.714351,5.283910
std,26.156536,78.600701,17.647450,24.999440,13.820680,2.454790,14.950849,0.250254,25.616070,9.509444,18.844908,2.741712
min,-37.814000,-123.121000,0.025000,0.061000,0.013000,0.003000,0.114000,0.000000,16.000000,5.000000,25.002000,0.500000
25%,12.972000,2.352000,27.904500,53.125500,22.362500,4.360750,38.028500,0.633000,87.000000,13.357750,41.320000,2.937000
50%,29.232000,42.146000,40.286500,69.961000,32.019500,6.026000,48.142000,0.800500,103.000000,21.455500,57.847000,5.297000
75%,41.008000,103.820000,52.436250,87.256500,41.364250,7.715250,58.258500,0.969000,121.000000,29.688250,74.234750,7.662000
max,60.170000,174.763000,115.683000,161.810000,90.019000,16.559000,103.016000,1.832000,231.000000,37.998000,89.997000,9.999000

# Indexing and Selecting Kaggle Data Set:

In [83]:
# Indexing and Selecting Kaggle Data Set:

# Columns:
data_frame["country"]
data_frame[["city", "aqi"]]

# Rows:
data_frame.loc[0]
data_frame.loc[0:2]

data_frame.iloc[0]
data_frame.iloc[0:2]

# Cells - Rows & Column:
data_frame.loc[0, "aqi"]
data_frame.loc[0, ["city", "aqi"]]

# data_frame.iloc[0, ["city", "aqi"]]
data_frame.columns

Index(['timestamp', 'country', 'city', 'latitude', 'longitude', 'pm25', 'pm10',
       'no2', 'so2', 'o3', 'co', 'aqi', 'temperature', 'humidity',
       'wind_speed'],
      dtype='object')

# Filerating Data in Pandas

In [106]:
# Filerating Data in Pandas:

data_frame[data_frame["aqi"] > 100]
data_frame[data_frame["aqi"] > 100]
data_frame[ (data_frame["aqi"] > 100) & (data_frame["temperature"] > 30)]

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
6,2025-11-05 00:25:17.554219,US,New York,40.713,-74.006,77.690,65.198,20.302,7.641,62.687,0.734,155,36.729,47.651,4.542
7,2025-11-05 01:25:17.554219,US,New York,40.713,-74.006,57.816,111.709,34.533,6.945,41.304,0.771,115,37.891,53.314,7.605
14,2025-11-05 08:25:17.554219,US,New York,40.713,-74.006,38.815,121.394,25.969,4.112,44.730,1.124,121,34.481,81.790,3.576
17,2025-11-05 11:25:17.554219,US,New York,40.713,-74.006,63.552,57.838,13.754,4.427,42.251,0.997,127,36.193,62.906,7.097
25,2025-11-05 19:25:17.554219,US,New York,40.713,-74.006,56.954,75.045,29.837,9.541,54.198,1.170,113,31.289,43.279,5.264
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17947,2025-11-17 13:25:17.554219,CH,Zurich,47.377,8.542,53.938,75.183,16.255,7.263,67.244,0.457,107,32.584,81.544,7.101
17950,2025-11-17 16:25:17.554219,CH,Zurich,47.377,8.542,70.255,60.620,32.081,2.065,47.803,0.852,140,36.885,34.173,1.748
17975,2025-11-18 17:25:17.554219,CH,Zurich,47.377,8.542,33.406,98.160,44.654,0.807,45.160,0.737,111,30.761,76.073,3.570
17976,2025-11-18 18:25:17.554219,CH,Zurich,47.377,8.542,73.493,89.558,9.313,4.768,51.505,0.745,146,30.909,81.573,1.024
17991,2025-11-19 09:25:17.554219,CH,Zurich,47.377,8.542,52.120,71.160,35.405,7.752,39.811,0.878,104,32.556,31.372,2.787

# Filerating Data using Queries in Pandas:

In [110]:
# Filerating Data using Queries in Pandas:

aqi_value = 100
data_frame.query("aqi > 100 & temperature > 30") [["city", "aqi"]]
data_frame.query("aqi > @aqi_value & temperature > 30") [["city", "aqi"]]

           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

# Data Cleaning - Handling Missing Values:

In [123]:
# Data Cleaning - Handling Missing Values:

data = pd.read_csv("raw_data.csv");

df.isnull()
df.isna()

df.isnull().sum()

df.dropna()

df.ffill()

df.bfill()

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [117]:
data

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

# Data Cleaning - Handling Dublicate Values:

In [ ]:
# Data Cleaning - Handling Dublicate Values: